---
kind: method
id: M:Autodesk.Revit.DB.TemporaryGraphicsManager.Clear
source: html/d1f91a81-eb1e-fc9e-de5d-cfcfdb359b10.htm
---
# Autodesk.Revit.DB.TemporaryGraphicsManager.Clear Method

Clear all temporary graphics objects managed by this manager.

## Syntax (C#)
```csharp
public void Clear()
```